Revit 2027 API
RebarConstraint.GetDistanceToTargetRebar Method
 Gets the distance from the RebarConstrainedHandle to the target Rebar handle surface. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDistanceToTargetRebar()
Public Function GetDistanceToTargetRebar As Double
public:
double GetDistanceToTargetRebar()
member GetDistanceToTargetRebar : unit -> float
Return Value
Double
 Returns the distance from the RebarConstrainedHandle to the target Rebar handle surface.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Remarks
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
Throws exception if the constraint is for a handle of a Free Form Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace